ruby_backend/app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    if comment.valid?
      comment.save
---
INSERT INTO "comments" ("content", "user_id", "drawing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hiya THERERERER"], ["user_id", 73], ["drawing_id", 54], ["created_at", "2020-03-25 22:54:34.623183"], ["updated_at", "2020-03-25 22:54:34.623183"]]