ruby_backend/app/controllers/drawings_controller.rb

SELECT "drawings".* FROM "drawings"
---
  def index
    drawings = Drawing.all

INSERT INTO "drawings" ("title", "description", "image", "published", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    drawing = Drawing.new(draw_params)
    #byebug
    if drawing.valid?
      drawing.save