ruby_backend/app/controllers/users_controller.rb

  def show
    #debugger
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]

  def create
    input_length = params[:username].length
    user_exists = User.find_by(username: params[:username])
    user = User.new(username: params[:username], password: params[:password])

    if user.valid?
      user.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", ""], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy
    user = User.find_by(id: params["id"])
    user.delete
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 74]]